## Practice 1

In [ ]:
count = [10, 20, 30, 40, 50]
for number in count:
    print(number)

10
20
30
40
50

## Practice 2

In [5]:
for num in range(5):
    if num > 0:
        print(num * 10)

10
20
30
40

## Practice3

In [6]:
count = 1
while count <= 5:
    print(count)
    count += 1

1
2
3
4
5

## Practice4

In [2]:
entry = 0
sum1 = 0
print("Enter numbers to find their sum negative number ends the loop:")
while True:
    entry = int(input("Enter a number: "))
    if (entry < 0):
        break
    sum1 += entry
print(f"Sum = {sum1}")

Enter numbers to find their sum negative number ends the loop:

Sum = 693

## Practice5

In [4]:
num = 0
for num in range(6):
    num = num + 1
    if num == 3:
        continue
    print(f"Num has value: {str(num)}")
print("End of loop")

Num has value: 1
Num has value: 2
Num has value: 4
Num has value: 5
Num has value: 6
End of loop

## Practice6

In [6]:
for var1 in range(3):
    print(f"Iteration {str(var1 + 1)} of outer loop")
    for var2 in range(2):
        print(var2 + 1)
        print("Out of inner loop")
print("Out of outer loop")

Iteration 1 of outer loop
1
Out of inner loop
2
Out of inner loop
Iteration 2 of outer loop
1
Out of inner loop
2
Out of inner loop
Iteration 3 of outer loop
1
Out of inner loop
2
Out of inner loop
Out of outer loop

## Exercise1

In [7]:
city_1 = input("Enter the name of the first city: ")
city_2 = input("Enter the name of the second city: ")

city_1, city_2 = city_2, city_1

print(f"The name of the first city is now: {city_1}")
print(f"The name of the second city is now: {city_2}")

The name of the first city is now: teka
The name of the second city is now: yam

## Exercise 2

In [8]:
num = float(input("Enter a number: "))
if num > 0:
    print("Positive number")
elif num == 0:
    print("Zero")
else:
    print("Negative number")

Positive number

## Exercise 3

In [9]:
print("Welcome to the COUPE DE ESCRIVA 2023: FOOTBALL PICKS \n")

captain = {'Madiba: ': 'Chubby Obiora-Okafo', 'Blue-Jays: ': 'Christopher Uweh',
            'Cirok: ': 'Alexander', 'TSG Walkers: ': 'Ikechukwu'}

goalkeepers = {'Madiba: ': 'Chubby Obiora-Okafo',
                'Blue-Jays: ': 'Oladimeji Abaniwondea/Jeffery Awagu',
                'Cirok: ': 'Timileyin Pearse/Izuako Jeremy',
                'TSG Walkers: ': 'Ayomide Ojituku'}

for pick in captain:
    print(pick, captain[pick])

print("\n")

for pick in goalkeepers:
    print(pick, goalkeepers[pick])

Welcome to the COUPE DE ESCRIVA 2023: FOOTBALL PICKS

Madiba:  Chubby Obiora-Okafo
Blue-Jays:  Christopher Uweh
Cirok:  Alexander
TSG Walkers:  Ikechukwu


Madiba:  Chubby Obiora-Okafo
Blue-Jays:  Oladimeji Abaniwondea/Jeffery Awagu
Cirok:  Timileyin Pearse/Izuako Jeremy
TSG Walkers:  Ayomide Ojituku

## Project 1

In [ ]:
import pandas as pd

data1 = {
    'Name':['Evelyn', 'Jessica', 'Somto', 'Edith', 'Liza', 'Madonna', 'Waje', 'Tola', 'Aisha', 'Latifa'],
    'Age':[17,16,17,18,16,18,17,20,19,17],
    'Height' :[5.5,6.0,5.4,5.9,5.6,5.5,6.1,6.0,5.7,5.5],
    'Scores' : [80,85,70,60,76,66,87,95,50,49]
}

data2 = {
    'Name' : ['Chinedu', 'Liam', 'Wale', 'Gbenga', 'Abiola', 'Kola', 'Kunle', 'George', 'Thomas', 'Wesley'],
    'Age'  : [19,16,18,17,20,19,16,18,17,19],
    'Height' : [5.8,6.0,5.9,5.7,5.6,5.8,6.1,6.0,5.9,5.7],
    'Scores' : [74,87,75,68,66,78,87,98,54,60]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print("DataFrame 1: Females")
display(df1)
print("DataFrame 2: Males")
display(df2)

DataFrame 1: Females

      Name  Age  Height  Scores
0   Evelyn   17     5.5      80
1  Jessica   16     6.0      85
2    Somto   17     5.4      70
3    Edith   18     5.9      60
4     Liza   16     5.6      76
5  Madonna   18     5.5      66
6     Waje   17     6.1      87
7     Tola   20     6.0      95
8    Aisha   19     5.7      50
9   Latifa   17     5.5      49

DataFrame 2: Males

      Name  Age  Height  Scores
0  Chinedu   19     5.8      74
1     Liam   16     6.0      87
2     Wale   18     5.9      75
3   Gbenga   17     5.7      68
4   Abiola   20     5.6      66
5     Kola   19     5.8      78
6    Kunle   16     6.1      87
7   George   18     6.0      98
8   Thomas   17     5.9      54
9   Wesley   19     5.7      60

      Name  Age  Height  Scores
0   Evelyn   17     5.5      80
1  Jessica   16     6.0      85
2    Somto   17     5.4      70
3    Edith   18     5.9      60
4     Liza   16     5.6      76
5  Madonna   18     5.5      66
6     Waje   17     6.1      87
7     Tola   20     6.0      95
8    Aisha   19     5.7      50
9   Latifa   17     5.5      49